# ColorSelectionDialog Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorSelectionDialog Constructor
ColorSelectionDialog Class See Also
---
Default constructor.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ColorSelectionDialog()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ColorSelectionDialog()
```

# See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace